src/cf/DataProcessors/CustomerIntegration.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>CustomerIntegration</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/Gender.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>Gender</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Male</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Female</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/DogOwners.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>DogOwners</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>PhoneNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateOfBirth</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Gender</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Gender</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>RelevantContacts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FullName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RelationshipWithDogOwner</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/CustomerIntegration/Forms/Form/Ext/Form/Module.bsl
&AtClient
Procedure ReadFileLists(Command) 
	//Open folder dialog
	Description = New NotifyDescription("FinishSelectFile", ThisObject);
	BeginPutFile(Description, , , True, ThisObject.UUID);
EndProcedure

&AtClient
Procedure FinishSelectFile(Result, Address, FileDicrectory, AdditionalParameters) Export
	If Result Then
		path = FileDicrectory;
		ImportDataAtServer(path);
	EndIf;  
	
EndProcedure

//Just use it, nothing to change
Function SetupConnection(FileName = "")
	Try
		Excel = New COMObject("Excel.Application");
	Except
		Message("Unable to create Com object: " + ErrorDescription(), MessageStatus.Important);
		Return Null;
	EndTry;
	
	Try
		Book = Excel.Workbooks.Add(FileName);
	Except
		Message("Unable to open Excel file: " + ErrorDescription());
		
		Excel.Quit();
		
		Excel = Null;
		
		Return Null;
	EndTry;
	
	Try
		Sheet = Book.Sheets(1);
	Except
		Message("Unable to get Sheet1 in the Excel file: " + ErrorDescription());
		
		Book.Close();
		Excel.Quit();
		
		Book = Null;
		Excel = Null;		
		
		Return Null;
	EndTry;
	
	StructureToReturn = New Structure;
	StructureToReturn.Insert("Excel", Excel);
	StructureToReturn.Insert("Sheet", Sheet);
	
	Return StructureToReturn;
EndFunction

&AtServer
Procedure ImportDataAtServer(path)
	Object.DataPath = path;
	ConnectionResult = SetupConnection(Object.DataPath);
	If ConnectionResult = Null Then
		Return;
	EndIf;
	Excel = ConnectionResult.Excel;
	Sheet = ConnectionResult.Sheet;
	RowsCount = Sheet.UsedRange.Rows.Count;
	
	Array = Excel.Range(Excel.Cells(2, 1), Excel.Cells(RowsCount, 6)).Value;
	
	Excel.Quit();
	
	Sheet = Null;
	Excel = Null;
	
	//Folder = Catalogs.DogOwners.FindByDescription(Object.ImportToFolder);
	
	//Import data from above array to catalog
	For Index = 1 to RowsCount - 1 Do
		If Not IsBlankString(Array.GetValue(1, Index)) Then
			NewItem = Catalogs.DogOwners.CreateItem();
			NewItem.Code = Array.GetValue(1, Index);
			NewItem.Password = Array.GetValue(2, Index); 
			NewItem.Description = Array.GetValue(3, Index);
			If Not IsBlankString(Array.GetValue(4, Index)) Then
				NewItem.DateOfBirth = Date(Array.GetValue(4, Index));
			EndIf;
			
			If StrCompare(Array.GetValue(5, Index), "Male") = 0 Then
				NewItem.Gender = Enums.Gender.Male;
			Else
				NewItem.Gender = Enums.Gender.Female;
			EndIf;
			NewItem.Address = Array.GetValue(6, Index);
			
			//NewItem.Parent = Folder;
			NewItem.Write();
		EndIf;
	EndDo;
EndProcedure
